uhnp/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/AccumulationRegisters/ДенежныеСредстваБезналичные/ДенежныеСредстваБезналичные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваБезналичные</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КЗачислению</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КСписанию</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлатежаФЗ275</name>
    <type>
      <types>CatalogRef.ТипыПлатежейФЗ275</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйДокумент</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЦелевыхСредств</name>
    <type>
      <types>CatalogRef.НаправленияРасходованияЦелевыхСредств</types>
      <types>CatalogRef.ИсточникиПоступленияЦелевыхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/НастройкиСистемыНалогообложения/НастройкиСистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСистемыНалогообложения</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяПлательщикомНДПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УведомлениеНомерУСН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УведомлениеДатаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяПСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименяетсяАУСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ДополнительныеАлгоритмыЗаполненияФормСтатистики/ДополнительныеАлгоритмыЗаполненияФормСтатистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДополнительныеАлгоритмыЗаполненияФормСтатистики</name>
  <enumValues>
    <name>Вычесть</name>
  </enumValues>
  <enumValues>
    <name>ДобавитьИтоговыйПоказательРозницаВсего</name>
  </enumValues>
  <enumValues>
    <name>ФормироватьТолькоЗаГод</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаПредпринимателя</name>
  </enumValues>
  <enumValues>
    <name>ЧисленностьПерсонала</name>
  </enumValues>
  <enumValues>
    <name>Группировка</name>
  </enumValues>
  <enumValues>
    <name>ДобавитьОтборПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ВычестьОтборПоказателя</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ИсточникиДанныхСтатистическихПоказателей/ИсточникиДанныхСтатистическихПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиДанныхСтатистическихПоказателей</name>
  <enumValues>
    <name>ВложенияВоВнеоборотныеАктивы</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоИПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкиИЗатраты</name>
  </enumValues>
  <enumValues>
    <name>ФинансовоеСостояние</name>
  </enumValues>
  <enumValues>
    <name>ОборотныеАктивы</name>
  </enumValues>
  <enumValues>
    <name>КредиторскаяЗадолженность</name>
  </enumValues>
  <enumValues>
    <name>ОперацииСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ГруппаПоказателей</name>
  </enumValues>
  <enumValues>
    <name>ОборотыСчета</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВнеоборотныхМатериальныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>НематериальныеАктивы</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеВнеоборотныхМатериальныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>ОсновныеСредстваВведенныеВЭксплуатациюПриПриобретении</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойВидДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ОплаченнаяРеализация</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыеВложения</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОсновныеФонды</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиСчета</name>
  </enumValues>
  <enumValues>
    <name>СведенияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>КапиталИРезервы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыЗадолженности/ВидыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗадолженности</name>
  <enumValues>
    <name>ВыданныеАвансы</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьКонтрагентовРегл</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьКонтрагентовВал</name>
  </enumValues>
  <enumValues>
    <name>ЗаймыВыданные</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/ЗаполнениеФормСтатистикиПереопределяемый/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Получает набор внешних данных по имени объекта.
// Параметры:
//	ИмяОбъекта - Строка - Идентификатор данных которые требуется получить.
// Возвращаемое значение:
//	ТаблицаЗначений, Неопределено - Набор данных в виде таблицы, если для запрашиваемого объекта нет данных возвращает неопределено.
//
Функция ВнешниеДанные(ИмяОбъекта, МакетКомпоновки) Экспорт
	
	Если ИмяОбъекта = "БуквенныеКодыРазделовОКВЭД2" Тогда
		// В схеме компоновки данных Перечисления.ИсточникиДанныхСтатистическихПоказателей.Макеты.ОсновнойВидДеятельности.
		Возврат ОрганизацииЛокализация.БуквенныеКодыРазделовОКВЭД2();
	ИначеЕсли ИмяОбъекта = "ЗадолженностьПокупателейПросроченнаяERP" Тогда
		// В схеме компоновки данных Перечисления.ИсточникиДанныхСтатистическихПоказателей.Макеты.ОборотныеАктивы.
		Возврат ЗаполнениеФормСтатистикиПереопределяемый.ЗадолженностьПокупателейПросроченная(МакетКомпоновки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает список форм статистики для которых может быть выполнена настройка заполнения
// и которые встречаются в настройках списка налогов и отчетов переданной организации.
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация для которой нужно найти формы.
// Возвращаемое значение:
// ТаблицаЗначений:
//	* Форма- СправочникСсылка.ФормыСтатистики - Форма статистики.
//	* Организация - СправочникСсылка.Организации - Организация.
//
Функция НастраиваемыеФормыСтатистикиПредоставляемыеОрганизацией(Организация) Экспорт

	Результат = Новый ТаблицаЗначений; // Ссылки на формы.
	Результат.Колонки.Добавить("Форма", 		Новый ОписаниеТипов("СправочникСсылка.ФормыСтатистики"));
	Результат.Колонки.Добавить("Организация", 	Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Возврат Результат;
	
КонецФункции

// Заполняет показатели выручки предпринимателя.
// Параметры:
//	Показатели - ТаблицаЗначений - Коллекция показателей формы статистики с необходимыми настройками, подробнее см. НовыйОписаниеПоказателей().
//	Формулы - ТаблицаЗначений - Коллекция показателей формы статистики для которых указан дополнительный алгоритм, подробнее см. НовыйОписаниеПоказателей().
//
Процедура ВыручкаПредпринимателя(Показатели, Формулы) Экспорт
	
	//++ НЕ УТ
	ВыручкаИППоВидамДеятельности = Неопределено;
	
	Для Каждого Формула Из Формулы Цикл
		
		Если Формула.ДополнительныйАлгоритм <> Перечисления.ДополнительныеАлгоритмыЗаполненияФормСтатистики.ВыручкаПредпринимателя Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыручкаИППоВидамДеятельности = Неопределено Тогда
			ВыручкаИППоВидамДеятельности = 
				ВыручкаИППоВидамДеятельности(Формула.Организация, Формула.НачалоПериода, Формула.КонецПериода);
		КонецЕсли;
		
		Для Каждого АналитикаВыручки Из ВыручкаИППоВидамДеятельности Цикл
			
			Для Каждого Показатель Из Формула.Элементы Цикл
				
				НовыйПоказатель = Показатели.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйПоказатель, Показатель.Показатель,, "ДополнительныйАлгоритм, Значение, Аналитика");
				
				Значение = Новый Структура();
				Значение.Вставить(НовыйПоказатель.Характеристика, Неопределено);
				ЗаполнитьЗначенияСвойств(Значение, АналитикаВыручки);
				
				НовыйПоказатель.Аналитика      = АналитикаВыручки.Аналитика;
				НовыйПоказатель.Значение       = Значение[НовыйПоказатель.Характеристика];
				НовыйПоказатель.Детализировать = Истина;
				
				Показатель.Удалить = Истина;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	//-- НЕ УТ

КонецПроцедуры

// Заполняет показатели численности персонала.
// Параметры:
//	Показатели - ТаблицаЗначений - Коллекция показателей формы статистики с необходимыми настройками, подробнее см. НовыйОписаниеПоказателей().
//	Формула - ТаблицаЗначений - Коллекция показателей формы статистики для которых указан дополнительный алгоритм, подробнее см. НовыйОписаниеПоказателей().
//	ПараметрыОтчета - Структура - структура параметров отчета.
//
Процедура ЧисленностьПерсонала(Показатели, Формула, ПараметрыОтчета) Экспорт

		Если Формула.ДополнительныйАлгоритм 
		<> Перечисления.ДополнительныеАлгоритмыЗаполненияФормСтатистики.ЧисленностьПерсонала Тогда
		Возврат;
	КонецЕсли;

	СведенияОЧисленности = КадровыйУчет.СреднесписочнаяЧисленностьРаботающих(
	ПараметрыОтчета.Организация, Формула.НачалоПериода, Формула.КонецПериода);

	Отбор =	Новый Структура;
	Отбор.Вставить("ДополнительныйАлгоритм", Перечисления.ДополнительныеАлгоритмыЗаполненияФормСтатистики.ЧисленностьПерсонала);
	Отбор.Вставить("НачалоПериода", Формула.НачалоПериода); 
	Отбор.Вставить("КонецПериода",  Формула.КонецПериода);
	
	ПоказателиЧисленности = Показатели.НайтиСтроки(Отбор);       
	
	Для Каждого Показатель Из ПоказателиЧисленности Цикл    
		Если Показатель.Характеристика = "СреднесписочнаяЧисленность" Тогда   
			Характеристика = "СреднесписочнаяЧисленностьРаботников";
		ИначеЕсли Показатель.Характеристика = "СреднесписочнаяЧисленностьСотрудников" Тогда
			Характеристика = "СреднесписочнаяЧисленностьРаботников";
		ИначеЕсли Показатель.Характеристика = "СреднесписочнаяЧисленностьСовместители" Тогда
			Характеристика = "СреднесписочнаяЧисленностьВнешнихСовместителей";
		Иначе
			Характеристика = Показатель.Характеристика; 
		КонецЕсли;	
		Если СведенияОЧисленности.Свойство(Характеристика) Тогда
			Показатель.Значение = СведенияОЧисленности[Характеристика]; 
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

// Выполняет поиск единицы измерения в классификаторе единиц измерения.
//
// Параметры:
//	КодЕдиницыИзмерения - Строка - код единицы измерения по ОКЕИ.
//	НаименованиеЕдиницыИзмерения - Строка - Наименование единицы измерения.
//
// Возвращаемое значение:
// СправочникСсылка.УпаковкиЕдиницыИзмерения, Неопределено - если поиск и попытка добавления элемента не дали результатов то неопределено.
//
Функция ЕдиницаИзмеренияПоКоду(КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения) Экспорт

	Результат = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(КодЕдиницыИзмерения);

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		// Еще нет такой единицы измерения, создадим.
		СозданныеЕдиницыИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ЗаполнитьЕдиницыИзмеренияИзКлассификатора(КодЕдиницыИзмерения, Истина);
		Результат = СозданныеЕдиницыИзмерения[КодЕдиницыИзмерения];
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Обработать распределение выручки на сервере.
Процедура ОбработатьРаспределениеВыручкиНаСервере() Экспорт
	
КонецПроцедуры

// Возвращает выручку по всем видам деятельности ИП на всех режимах налогообложения за указанный период
// Параметры:
//  Организация - СправочникСсылка.Организации
//  НачалоПериода - Дата
//  КонецПериода - Дата
// Возвращаемое значение:
//  ТаблицаЗначений:
//	* Выручка - Число.
//	* ПрочиеДоходы - Число.
//	* Аналитика - Строка.
//	* Процент - Число.
//	* Процент1 - Строка.
//	* Процент2 - Строка.
//	* Процент3 - Строка.
//	* КодОКВЭД - Строка.
//	 подробнее см. НовыйВыручкаПоВидамДеятельности()
//
Функция ВыручкаИППоВидамДеятельности(Организация, НачалоПериода, КонецПериода) Экспорт
	
	ВыручкаПоВидамДеятельности = НовыйВыручкаПоВидамДеятельности();

	//++ НЕ УТ
	
	НаименованиеОсновногоВидаДеятельности = ""; // для всех налоговых режимов, кроме случая, когда для НДФЛ указан свой основной вид деятельности
	ОКВЭДОсновногоВидаДеятельности = ""; // для всех налоговых режимов, кроме случая, когда для НДФЛ указан свой основной вид деятельности
	
	РеквизитыОрганизации = "ЮридическоеФизическоеЛицо, КодОКВЭД2, НаименованиеОКВЭД2";
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, РеквизитыОрганизации);
	
	НаименованиеОсновногоВидаДеятельности = РеквизитыОрганизации.НаименованиеОКВЭД2;
	ОКВЭДОсновногоВидаДеятельности = РеквизитыОрганизации.КодОКВЭД2;
	
	#Область ВыручкаУСН
	
	НачалоПериодаИлиРегистрации = НачалоПериода;
	ДатаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ДатаРегистрации");
	Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Если ДатаРегистрации <= КонецПериода И ДатаРегистрации > НачалоПериода Тогда
			НачалоПериодаИлиРегистрации = ДатаРегистрации;
		КонецЕсли;
	КонецЕсли;
	
	ОборотыКУДиРЗаПериод = УчетУСНПСНСервер.ОборотыКУДиРЗаПериод(Организация, НачалоПериодаИлиРегистрации, КонецПериода);
	
	// Если УСН не применяется, то ниже строка будет удалена, т.к. сумма нулевая
	ВыручкаПоВидуДеятельности           = ВыручкаПоВидамДеятельности.Добавить();
	ВыручкаПоВидуДеятельности.Выручка   = ОборотыКУДиРЗаПериод.Доходы;
	ВыручкаПоВидуДеятельности.Аналитика = НаименованиеОсновногоВидаДеятельности;
	ВыручкаПоВидуДеятельности.КодОКВЭД  = ОКВЭДОсновногоВидаДеятельности;
	
	#КонецОбласти
		
	#Область ВыручкаПатент
	
	ПатентыИП = ЗаполнениеФинОтчетностиВБанкиУП.ПатентыОрганизацииЗаПериод(Организация, НачалоПериода, КонецПериода);
	
	Для Каждого Патент Из ПатентыИП Цикл
		
		ПараметрыОтчета = Отчеты.КнигаУчетаДоходовПатент.ПустыеПараметрыКомпоновкиОтчета();
		ПараметрыОтчета.Организация   = Организация;
		ПараметрыОтчета.Патент        = Патент.Ссылка;
		ПараметрыОтчета.НачалоПериода = НачалоПериода;
		ПараметрыОтчета.КонецПериода  = КонецПериода;
		
		Отчеты.КнигаУчетаДоходовПатент.ПодготовитьОтчет(ПараметрыОтчета);
		
		КнигаУчетаДоходовПатент = ПараметрыОтчета.КнигаУчетаДоходовПатент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
		
		Если КнигаУчетаДоходовПатент.Следующий() Тогда
			
			ВыручкаПоВидуДеятельности           = ВыручкаПоВидамДеятельности.Добавить();
			ВыручкаПоВидуДеятельности.Выручка    = КнигаУчетаДоходовПатент.Графа4;
			ВыручкаПоВидуДеятельности.Аналитика = Патент.Наименование;
			// Код ОКВЭД пользователь указывает вручную
		
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ВыручкаАУСН
	
	// Если АУСН не применяется, то ниже строка будет удалена, т.к. сумма нулевая
	ВыручкаПоВидуДеятельности           = ВыручкаПоВидамДеятельности.Добавить();
	ВыручкаПоВидуДеятельности.Выручка   = СуммаДоходовАУСН(Организация, НачалоПериодаИлиРегистрации, КонецПериода);
	ВыручкаПоВидуДеятельности.Аналитика = НаименованиеОсновногоВидаДеятельности;
	ВыручкаПоВидуДеятельности.КодОКВЭД  = ОКВЭДОсновногоВидаДеятельности;
	
	#КонецОбласти
	
	СтрокиСНулевойВыручкой = Новый Массив;
	
	Для Каждого СтрокаВыручки Из ВыручкаПоВидамДеятельности Цикл
		
		Если СтрокаВыручки.Выручка <= 0 Тогда
			СтрокиСНулевойВыручкой.Добавить(СтрокаВыручки);
			Продолжить;
		Иначе
		СтрокаВыручки.Процент = СтрокаВыручки.Выручка*100/ВыручкаПоВидамДеятельности.Итог("Выручка");
		
		ПроцентСтрокой = Формат(СтрокаВыручки.Процент, "ЧЦ=3; ЧДЦ=");
		
		Если СтрокаВыручки.Процент = 100 Тогда
			СтрокаВыручки.Процент1 = "0";
			СтрокаВыручки.Процент2 = "0";
			СтрокаВыручки.Процент3 = "1";
		ИначеЕсли СтрокаВыручки.Процент >= 10 Тогда
			СтрокаВыручки.Процент1 = Прав(ПроцентСтрокой, 1);
			СтрокаВыручки.Процент2 = Лев(ПроцентСтрокой, 1);
			СтрокаВыручки.Процент3 = "";
		Иначе
			СтрокаВыручки.Процент1 = Прав(ПроцентСтрокой, 1);
			СтрокаВыручки.Процент2 = "";
			СтрокаВыручки.Процент3 = "";
		КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаКУдалению Из СтрокиСНулевойВыручкой Цикл
		
		ВыручкаПоВидамДеятельности.Удалить(СтрокаКУдалению);
		
	КонецЦикла;
	
	ВыручкаПоВидамДеятельности.Сортировать("Процент Убыв");
	
	//-- НЕ УТ
	Возврат ВыручкаПоВидамДеятельности;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗадолженностьПокупателейПросроченная(МакетКомпоновки) Экспорт
	
	Организации = МакетКомпоновки.ЗначенияПараметров.Организация.Значение;
	Данные = Новый ТаблицаЗначений;
	
	Для Каждого Организация Из Организации Цикл
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Организация", Организация.Значение);
		ПараметрыЗаполнения.Вставить("Дата", МакетКомпоновки.ЗначенияПараметров.КонецПериода.Значение);
		ПараметрыЗаполнения.Вставить("ПустойДокумент", Истина);
		
		Результат = Документы.НачислениеСписаниеРезервовПоСомнительнымДолгам.ПолучитьДанныеДляЗаполненияДебиторскойЗадолженности(ПараметрыЗаполнения);
		ДанныеЗадолженности = Результат.Выгрузить();
		ДанныеЗадолженности.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ДанныеЗадолженности.ЗаполнитьЗначения(Организация.Значение, "Организация");
		
		Если Данные.Количество() = 0 Тогда
			Данные = ДанныеЗадолженности;
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗадолженности, Данные);
		КонецЕсли;
		
	КонецЦикла;
	
	СчетаОтбор = Новый СписокЗначений;
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Отбор.ЗадолженностьПокупателей");
	НастройкиОтбора = Перечисления.ИсточникиДанныхСтатистическихПоказателей.ПолучитьМакет("ОборотныеАктивы").НастройкиПоУмолчанию.Отбор;
	Для Каждого Отбор Из НастройкиОтбора.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеОтбора Тогда
			СчетаОтбор = Отбор.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаДанные", Данные);
	Запрос.УстановитьПараметр("СчетаОтбор", СчетаОтбор);
	Запрос.УстановитьПараметр("Организация", МакетКомпоновки.ЗначенияПараметров.Организация.Значение);
	Запрос.УстановитьПараметр("КонецПериода", МакетКомпоновки.ЗначенияПараметров.КонецПериода.Значение);
	Запрос.УстановитьПараметр("ВидыСубконтоКонтрагентИДоговор",МакетКомпоновки.ЗначенияПараметров.ВидыСубконтоКонтрагентИДоговор.Значение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанные.Организация КАК Организация,
	|	ТаблицаДанные.Партнер КАК Партнер,
	|	ТаблицаДанные.Контрагент КАК Контрагент,
	|	ТаблицаДанные.Договор КАК Договор,
	|	ТаблицаДанные.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДанные.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаДанные.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТаблицаДанные.ТипСуммы КАК ТипСуммы,
	|	ТаблицаДанные.ДатаВозникновенияЗадолженности КАК ДатаВозникновенияЗадолженности,
	|	ТаблицаДанные.СуммаЗадолженностиРегл КАК СуммаЗадолженностиРегл,
	|	ТаблицаДанные.СуммаЗадолженности КАК СуммаЗадолженности,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.СуммаОбеспеченияПоАналитике КАК СуммаОбеспеченияПоАналитике,
	|	ТаблицаДанные.Оценка КАК Оценка,
	|	ТаблицаДанные.РезервБУ КАК РезервБУ,
	|	ТаблицаДанные.Резерв КАК Резерв,
	|	ТаблицаДанные.ВидЗадолженности КАК ВидЗадолженности,
	|	ТаблицаДанные.НеНачислять КАК НеНачислять,
	|	ТаблицаДанные.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ТаблицаДанные.НужнаПроверка КАК НужнаПроверка
	|ПОМЕСТИТЬ ВтДанные
	|ИЗ
	|	&ТаблицаДанные КАК ТаблицаДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанные.Организация КАК Организация,
	|	ЕСТЬNULL(ВтДанные.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(ВтДанные.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	ВтДанные.ДатаВозникновенияЗадолженности КАК ДатаВозникновенияЗадолженности,
	|	ВтДанные.СуммаЗадолженностиРегл КАК СуммаЗадолженности
	|ПОМЕСТИТЬ втЗадолженностьПокупателейПросроченная
	|ИЗ
	|	ВтДанные КАК ВтДанные
	|ГДЕ
	|	ВтДанные.РучнаяКорректировка = ЛОЖЬ
	|	И ВтДанные.ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ЗадолженностьКонтрагентовРегл),
	|									ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ЗадолженностьКонтрагентовВал))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_Счета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В(&СчетаОтбор)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПокупателейПоДоговорам.Счет КАК Счет,
	|	ЗадолженностьПокупателейПоДоговорам.Организация КАК Организация,
	|	ЕСТЬNULL(ЗадолженностьПокупателейПоДоговорам.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(ЗадолженностьПокупателейПоДоговорам.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор
	|ПОМЕСТИТЬ ДоговорыПоКоторымЕстьЗадолженностьПокупателей
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗадолженностьПокупателей.Счет КАК Счет,
	|		ЗадолженностьПокупателей.Организация КАК Организация,
	|		ВЫРАЗИТЬ(ЗадолженностьПокупателей.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|		ВЫРАЗИТЬ(ЗадолженностьПокупателей.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(
	|				&КонецПериода,
	|				Счет В
	|					(ВЫБРАТЬ
	|						ВТ_Счета.Счет
	|					ИЗ
	|						ВТ_Счета КАК ВТ_Счета),
	|				&ВидыСубконтоКонтрагентИДоговор,
	|				Организация В (&Организация)) КАК ЗадолженностьПокупателей
	|	ГДЕ
	|		ЗадолженностьПокупателей.СуммаРазвернутыйОстатокДт > 0) КАК ЗадолженностьПокупателейПоДоговорам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПокупателей.Счет КАК Счет,
	|	ЗадолженностьПокупателей.Организация КАК Организация,
	|	ЗадолженностьПокупателей.Контрагент КАК Контрагент,
	|	ЗадолженностьПокупателей.Договор КАК Договор,
	|	ДОБАВИТЬКДАТЕ(ЗадолженностьПокупателейПросроченная.ДатаВозникновенияЗадолженности, ДЕНЬ, ВЫБОР
	|			КОГДА ДоговорыКонтрагентов.УстановленСрокОплаты
	|				ТОГДА ДоговорыКонтрагентов.СрокОплаты
	|			ИНАЧЕ 30
	|		КОНЕЦ) КАК СрокОплаты,
	|	ЗадолженностьПокупателейПросроченная.СуммаЗадолженности КАК Сумма
	|ПОМЕСТИТЬ ДебиторскаяЗадолженностьПоСрокамОплаты
	|ИЗ
	|	ДоговорыПоКоторымЕстьЗадолженностьПокупателей КАК ЗадолженностьПокупателей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадолженностьПокупателейПросроченная КАК ЗадолженностьПокупателейПросроченная
	|		ПО ЗадолженностьПокупателей.Организация = ЗадолженностьПокупателейПросроченная.Организация
	|			И ЗадолженностьПокупателей.Контрагент = ЗадолженностьПокупателейПросроченная.Контрагент
	|			И ЗадолженностьПокупателей.Договор = ЗадолженностьПокупателейПросроченная.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ЗадолженностьПокупателей.Договор = ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДебиторскаяЗадолженность.Счет КАК Счет,
	|	ДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ДебиторскаяЗадолженность.Договор КАК Договор,
	|	СУММА(ДебиторскаяЗадолженность.Сумма) КАК Сумма
	|ИЗ
	|	ДебиторскаяЗадолженностьПоСрокамОплаты КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.СрокОплаты < &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДебиторскаяЗадолженность.Счет,
	|	ДебиторскаяЗадолженность.Контрагент,
	|	ДебиторскаяЗадолженность.Договор";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НовыйВыручкаПоВидамДеятельности()
	
	ОдинСимволСтрокой = Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(1));
	
	ВыручкаПоВидамДеятельности = Новый ТаблицаЗначений;
	ВыручкаПоВидамДеятельности.Колонки.Добавить("Выручка",      Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Неотрицательный)));
	ВыручкаПоВидамДеятельности.Колонки.Добавить("ПрочиеДоходы", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2, ДопустимыйЗнак.Неотрицательный)));
	ВыручкаПоВидамДеятельности.Колонки.Добавить("Аналитика",    Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(255)));
	ВыручкаПоВидамДеятельности.Колонки.Добавить("Процент",      Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0)));
	ВыручкаПоВидамДеятельности.Колонки.Добавить("Процент1",     ОдинСимволСтрокой);
	ВыручкаПоВидамДеятельности.Колонки.Добавить("Процент2",     ОдинСимволСтрокой);
	ВыручкаПоВидамДеятельности.Колонки.Добавить("Процент3",     ОдинСимволСтрокой);
	ВыручкаПоВидамДеятельности.Колонки.Добавить("КодОКВЭД",     Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(12)));
	
	Возврат ВыручкаПоВидамДеятельности;
	
КонецФункции

Функция СуммаДоходовАУСН(Организация, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ДенежныеСредстваБезналичные.СуммаРегл) КАК СуммаРегл
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредстваБезналичные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&КонецПериода, ) КАК НастройкиСистемыНалогообложенияСрезПоследних
	|		ПО ДенежныеСредстваБезналичные.Организация = НастройкиСистемыНалогообложенияСрезПоследних.Организация
	|ГДЕ
	|	ДенежныеСредстваБезналичные.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредстваБезналичные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДенежныеСредстваБезналичные.Организация = &Организация
	|	И ДенежныеСредстваБезналичные.СтатьяДвиженияДенежныхСредств.НеУчитываетсяВНалоговойБазеАУСН = ЛОЖЬ
	|	И ДенежныеСредстваБезналичные.Активность
	|	И НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяАУСН = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаРегл;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
